<?xml version="1.0"?>
<net name="onnx_Frontend_IR" version="11">
	<layers>
		<layer id="0" name="input" type="Parameter" version="opset1">
			<data shape="?,64,128,3" element_type="u8" />
			<rt_info>
				<attribute name="old_api_map_element_type" version="0" value="f32" />
			</rt_info>
			<output>
				<port id="0" precision="U8" names="input">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Constant_97864" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="0" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="CCT_OCR_1/Cast" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="U8">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="CCT_OCR_1/Cast:0">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Constant_97817_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1, 1" offset="4" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Constant_97817" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="CCT_OCR_1/rescaling_1/mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="CCT_OCR_1/rescaling_1/add:0">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Constant_92022" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="6" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="CCT_OCR_1/conv_stem_1/conv2d_1/BiasAdd__366" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="CCT_OCR_1/conv_stem_1/conv2d_1/BiasAdd__366:0">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>64</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="CCT_OCR_1/conv_stem_1/conv2d_1/convolution/ReadVariableOp:0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="32, 3, 3, 3" offset="38" size="1728" />
			<output>
				<port id="0" precision="FP16" names="CCT_OCR_1/conv_stem_1/conv2d_1/convolution/ReadVariableOp:0">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="CCT_OCR_1/conv_stem_1/conv2d_1/convolution/ReadVariableOp:0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="CCT_OCR_1/conv_stem_1/conv2d_1/BiasAdd/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>64</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>62</dim>
					<dim>126</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Reshape_92037_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="1766" size="64" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Reshape_92037" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="CCT_OCR_1/conv_stem_1/conv2d_1/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>62</dim>
					<dim>126</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="CCT_OCR_1/conv_stem_1/conv2d_1/BiasAdd:0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>62</dim>
					<dim>126</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="CCT_OCR_1/conv_stem_1/conv2d_1/mul_1" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>62</dim>
					<dim>126</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="CCT_OCR_1/conv_stem_1/conv2d_1/mul_1:0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>62</dim>
					<dim>126</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="CCT_OCR_1/conv_stem_1/max_blur_pooling2d_1/MaxPool2d" type="MaxPool" version="opset8">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="1, 1" kernel="2, 2" rounding_type="floor" auto_pad="explicit" index_element_type="i64" axis="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>62</dim>
					<dim>126</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="CCT_OCR_1/conv_stem_1/max_blur_pooling2d_1/MaxPool2d:0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>62</dim>
					<dim>126</dim>
				</port>
				<port id="2" precision="I64">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>62</dim>
					<dim>126</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Reshape_92051_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="32, 1, 1, 3, 3" offset="1830" size="576" />
			<output>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Reshape_92051" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="CCT_OCR_1/conv_stem_1/max_blur_pooling2d_1/depthwise" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="0, 0" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>62</dim>
					<dim>126</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="CCT_OCR_1/conv_stem_1/max_blur_pooling2d_1/depthwise:0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>31</dim>
					<dim>63</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="CCT_OCR_1/conv_stem_1/conv2d_1_2/convolution/ReadVariableOp:0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="48, 32, 3, 3" offset="2406" size="27648" />
			<output>
				<port id="0" precision="FP16" names="CCT_OCR_1/conv_stem_1/conv2d_1_2/convolution/ReadVariableOp:0">
					<dim>48</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="CCT_OCR_1/conv_stem_1/conv2d_1_2/convolution/ReadVariableOp:0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>48</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="CCT_OCR_1/conv_stem_1/conv2d_1_2/BiasAdd/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>31</dim>
					<dim>63</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>29</dim>
					<dim>61</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Reshape_92104" type="Const" version="opset1">
			<data element_type="f32" shape="1, 48, 1, 1" offset="30054" size="192" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="CCT_OCR_1/conv_stem_1/conv2d_1_2/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>29</dim>
					<dim>61</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="CCT_OCR_1/conv_stem_1/conv2d_1_2/BiasAdd:0">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>29</dim>
					<dim>61</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="CCT_OCR_1/conv_stem_1/conv2d_1_2/mul_1" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>29</dim>
					<dim>61</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="CCT_OCR_1/conv_stem_1/conv2d_1_2/mul_1:0">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>29</dim>
					<dim>61</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="CCT_OCR_1/conv_stem_1/conv2d_2_1/convolution/ReadVariableOp:0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="64, 48, 3, 3" offset="30246" size="55296" />
			<output>
				<port id="0" precision="FP16" names="CCT_OCR_1/conv_stem_1/conv2d_2_1/convolution/ReadVariableOp:0">
					<dim>64</dim>
					<dim>48</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="CCT_OCR_1/conv_stem_1/conv2d_2_1/convolution/ReadVariableOp:0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>48</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>48</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="CCT_OCR_1/conv_stem_1/conv2d_2_1/BiasAdd/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>29</dim>
					<dim>61</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>48</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>59</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Reshape_92121_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64, 1, 1" offset="85542" size="128" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Reshape_92121" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="CCT_OCR_1/conv_stem_1/conv2d_2_1/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>59</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="CCT_OCR_1/conv_stem_1/conv2d_2_1/BiasAdd:0">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>59</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="CCT_OCR_1/conv_stem_1/conv2d_2_1/mul_1" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>59</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="CCT_OCR_1/conv_stem_1/conv2d_2_1/mul_1:0">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>59</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="CCT_OCR_1/conv_stem_1/max_blur_pooling2d_1_2/MaxPool2d" type="MaxPool" version="opset8">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="1, 1" kernel="2, 2" rounding_type="floor" auto_pad="explicit" index_element_type="i64" axis="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>59</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="CCT_OCR_1/conv_stem_1/max_blur_pooling2d_1_2/MaxPool2d:0">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>59</dim>
				</port>
				<port id="2" precision="I64">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>59</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Reshape_92135_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="64, 1, 1, 3, 3" offset="85670" size="1152" />
			<output>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Reshape_92135" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="CCT_OCR_1/conv_stem_1/max_blur_pooling2d_1_2/depthwise" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>27</dim>
					<dim>59</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="CCT_OCR_1/conv_stem_1/max_blur_pooling2d_1_2/depthwise:0">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>14</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="CCT_OCR_1/conv_stem_1/conv2d_3_1/convolution/ReadVariableOp:0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="80, 64, 3, 3" offset="86822" size="92160" />
			<output>
				<port id="0" precision="FP16" names="CCT_OCR_1/conv_stem_1/conv2d_3_1/convolution/ReadVariableOp:0">
					<dim>80</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="CCT_OCR_1/conv_stem_1/conv2d_3_1/convolution/ReadVariableOp:0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>80</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>80</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="CCT_OCR_1/conv_stem_1/conv2d_3_1/BiasAdd/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>14</dim>
					<dim>30</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>80</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>80</dim>
					<dim>12</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Reshape_92188_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 80, 1, 1" offset="178982" size="160" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>80</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Reshape_92188" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>80</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>80</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="CCT_OCR_1/conv_stem_1/conv2d_3_1/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>80</dim>
					<dim>12</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>80</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="CCT_OCR_1/conv_stem_1/conv2d_3_1/BiasAdd:0">
					<dim>-1</dim>
					<dim>80</dim>
					<dim>12</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="CCT_OCR_1/conv_stem_1/conv2d_3_1/mul_1" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>80</dim>
					<dim>12</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="CCT_OCR_1/conv_stem_1/conv2d_3_1/mul_1:0">
					<dim>-1</dim>
					<dim>80</dim>
					<dim>12</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="CCT_OCR_1/conv_stem_1/conv2d_4_1/convolution/ReadVariableOp:0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="96, 80, 3, 3" offset="179142" size="138240" />
			<output>
				<port id="0" precision="FP16" names="CCT_OCR_1/conv_stem_1/conv2d_4_1/convolution/ReadVariableOp:0">
					<dim>96</dim>
					<dim>80</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="CCT_OCR_1/conv_stem_1/conv2d_4_1/convolution/ReadVariableOp:0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>96</dim>
					<dim>80</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>80</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="CCT_OCR_1/conv_stem_1/conv2d_4_1/BiasAdd/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>80</dim>
					<dim>12</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>80</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>10</dim>
					<dim>26</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Reshape_92205_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 96, 1, 1" offset="317382" size="192" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Reshape_92205" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="CCT_OCR_1/conv_stem_1/conv2d_4_1/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>10</dim>
					<dim>26</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="CCT_OCR_1/conv_stem_1/conv2d_4_1/BiasAdd:0">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>10</dim>
					<dim>26</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="CCT_OCR_1/conv_stem_1/conv2d_4_1/mul_1" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>10</dim>
					<dim>26</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="CCT_OCR_1/conv_stem_1/conv2d_4_1/mul_1:0">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>10</dim>
					<dim>26</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="CCT_OCR_1/patch_extractor_1/convolution__410:0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="384, 96, 2, 2" offset="317574" size="294912" />
			<output>
				<port id="0" precision="FP16" names="CCT_OCR_1/patch_extractor_1/convolution__410:0">
					<dim>384</dim>
					<dim>96</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="CCT_OCR_1/patch_extractor_1/convolution__410:0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>384</dim>
					<dim>96</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>384</dim>
					<dim>96</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="CCT_OCR_1/patch_extractor_1/convolution" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>10</dim>
					<dim>26</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>384</dim>
					<dim>96</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="CCT_OCR_1/patch_extractor_1/convolution:0">
					<dim>-1</dim>
					<dim>384</dim>
					<dim>5</dim>
					<dim>13</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Constant_92216" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="612486" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="CCT_OCR_1/patch_extractor_1/convolution__411" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>384</dim>
					<dim>5</dim>
					<dim>13</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="CCT_OCR_1/patch_extractor_1/convolution__411:0">
					<dim>-1</dim>
					<dim>5</dim>
					<dim>13</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Constant_98116" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="612518" size="24" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="CCT_OCR_1/patch_extractor_1/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>5</dim>
					<dim>13</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="CCT_OCR_1/patch_extractor_1/Reshape_1:0">
					<dim>-1</dim>
					<dim>65</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Transpose_96160_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="96, 384" offset="612542" size="73728" />
			<output>
				<port id="0" precision="FP16">
					<dim>96</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Transpose_96160" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>96</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="CCT_OCR_1/mlp_1/dense_1/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>65</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="CCT_OCR_1/mlp_1/dense_1/MatMul:0">
					<dim>-1</dim>
					<dim>65</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Constant_97818_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 96" offset="686270" size="192" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Constant_97818" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="CCT_OCR_1/mlp_1/dense_1/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>65</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="CCT_OCR_1/mlp_1/dense_1/BiasAdd:0">
					<dim>-1</dim>
					<dim>65</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="CCT_OCR_1/mlp_1/dense_1/mul_1" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>65</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="CCT_OCR_1/mlp_1/dense_1/mul_1:0">
					<dim>-1</dim>
					<dim>65</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Constant_97819_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 65, 96" offset="686462" size="12480" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>65</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Constant_97819" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>65</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>65</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Add_96008" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>65</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>65</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>65</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="ShapeOf_96009" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>65</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="CCT_OCR_1/pos_emb_1/BroadcastTo__440:0,CCT_OCR_1/pos_emb_1/Shape:0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Maximum_96010" type="Maximum" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="CCT_OCR_1/Add" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>65</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="CCT_OCR_1/Add:0">
					<dim>-1</dim>
					<dim>65</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Constant_97820" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="698942" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="CCT_OCR_1/transformer_block_1_1/dy_t_1/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>65</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="CCT_OCR_1/transformer_block_1_1/dy_t_1/Mul:0">
					<dim>-1</dim>
					<dim>65</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="CCT_OCR_1/transformer_block_1_1/dy_t_1/Tanh" type="Tanh" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>65</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="CCT_OCR_1/transformer_block_1_1/dy_t_1/Tanh:0">
					<dim>-1</dim>
					<dim>65</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Constant_97821_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 96" offset="698946" size="192" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Constant_97821" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="CCT_OCR_1/transformer_block_1_1/dy_t_1/mul_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>65</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="CCT_OCR_1/transformer_block_1_1/dy_t_1/mul_1:0">
					<dim>-1</dim>
					<dim>65</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Constant_97822_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 96" offset="699138" size="192" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Constant_97822" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="CCT_OCR_1/transformer_block_1_1/dy_t_1/add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>65</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="CCT_OCR_1/transformer_block_1_1/dy_t_1/add:0">
					<dim>-1</dim>
					<dim>65</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Transpose_96176_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="96, 96" offset="699330" size="18432" />
			<output>
				<port id="0" precision="FP16">
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Transpose_96176" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="CCT_OCR_1/transformer_block_1_1/multi_head_attention_1/key_1/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>65</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="CCT_OCR_1/transformer_block_1_1/multi_head_attention_1/key_1/MatMul:0">
					<dim>-1</dim>
					<dim>65</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="const_fold_opt__593" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="717762" size="32" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="const_fold_opt__593">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="CCT_OCR_1/transformer_block_1_1/multi_head_attention_1/key_1/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>65</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="CCT_OCR_1/transformer_block_1_1/multi_head_attention_1/key_1/Reshape_1:0">
					<dim>-1</dim>
					<dim>65</dim>
					<dim>2</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Constant_97823_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 2, 48" offset="717794" size="192" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Constant_97823" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2</dim>
					<dim>48</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="CCT_OCR_1/transformer_block_1_1/multi_head_attention_1/key_1/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>65</dim>
					<dim>2</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2</dim>
					<dim>48</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="CCT_OCR_1/transformer_block_1_1/multi_head_attention_1/key_1/Add:0">
					<dim>-1</dim>
					<dim>65</dim>
					<dim>2</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Constant_92299" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="717986" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="CCT_OCR_1/transformer_block_1_1/multi_head_attention_1/transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>65</dim>
					<dim>2</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="CCT_OCR_1/transformer_block_1_1/multi_head_attention_1/transpose:0">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>65</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Transpose_96181_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="96, 96" offset="718018" size="18432" />
			<output>
				<port id="0" precision="FP16">
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Transpose_96181" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="CCT_OCR_1/transformer_block_1_1/multi_head_attention_1/query_1/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>65</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="CCT_OCR_1/transformer_block_1_1/multi_head_attention_1/query_1/MatMul:0">
					<dim>-1</dim>
					<dim>65</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="CCT_OCR_1/transformer_block_1_1/multi_head_attention_1/query_1/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>65</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="CCT_OCR_1/transformer_block_1_1/multi_head_attention_1/query_1/Reshape_1:0">
					<dim>-1</dim>
					<dim>65</dim>
					<dim>2</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Constant_97824" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="736450" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Multiply_97617" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>65</dim>
					<dim>2</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>65</dim>
					<dim>2</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Constant_97825_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 2, 48" offset="736454" size="192" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Constant_97825" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2</dim>
					<dim>48</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="CCT_OCR_1/transformer_block_1_1/multi_head_attention_1/Mul" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>65</dim>
					<dim>2</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2</dim>
					<dim>48</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="CCT_OCR_1/transformer_block_1_1/multi_head_attention_1/Mul:0">
					<dim>-1</dim>
					<dim>65</dim>
					<dim>2</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Constant_92301" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="612486" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="CCT_OCR_1/transformer_block_1_1/multi_head_attention_1/transpose_1" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>65</dim>
					<dim>2</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="CCT_OCR_1/transformer_block_1_1/multi_head_attention_1/transpose_1:0">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>48</dim>
					<dim>65</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="CCT_OCR_1/transformer_block_1_1/multi_head_attention_1/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>65</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>48</dim>
					<dim>65</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="CCT_OCR_1/transformer_block_1_1/multi_head_attention_1/MatMul:0">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>65</dim>
					<dim>65</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="CCT_OCR_1/transformer_block_1_1/multi_head_attention_1/softmax_1_1/Softmax" type="SoftMax" version="opset8">
			<data axis="2" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>65</dim>
					<dim>65</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="CCT_OCR_1/transformer_block_1_1/multi_head_attention_1/softmax_1_1/Softmax:0">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>65</dim>
					<dim>65</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Transpose_96188_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="96, 96" offset="736646" size="18432" />
			<output>
				<port id="0" precision="FP16">
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="Transpose_96188" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="CCT_OCR_1/transformer_block_1_1/multi_head_attention_1/value_1/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>65</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="CCT_OCR_1/transformer_block_1_1/multi_head_attention_1/value_1/MatMul:0">
					<dim>-1</dim>
					<dim>65</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="CCT_OCR_1/transformer_block_1_1/multi_head_attention_1/value_1/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>65</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="CCT_OCR_1/transformer_block_1_1/multi_head_attention_1/value_1/Reshape_1:0">
					<dim>-1</dim>
					<dim>65</dim>
					<dim>2</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Constant_97826_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 2, 48" offset="755078" size="192" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2</dim>
					<dim>48</dim>
				</port>
