<?xml version="1.0"?>
<net name="onnx_Frontend_IR" version="11">
	<layers>
		<layer id="0" name="input" type="Parameter" version="opset1">
			<data shape="?,64,128,3" element_type="u8" />
			<rt_info>
				<attribute name="old_api_map_element_type" version="0" value="f32" />
			</rt_info>
			<output>
				<port id="0" precision="U8" names="input">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Constant_106276_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1" offset="0" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Constant_106276" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="CCT_OCR_1/Cast" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="U8">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="CCT_OCR_1/Cast:0">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Constant_106203_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1, 1" offset="2" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Constant_106203" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="CCT_OCR_1/rescaling_1/mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="CCT_OCR_1/rescaling_1/add:0">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Constant_99820" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="4" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="CCT_OCR_1/conv_stem_1/conv2d_1/BiasAdd__366" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="CCT_OCR_1/conv_stem_1/conv2d_1/BiasAdd__366:0">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>64</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="CCT_OCR_1/conv_stem_1/conv2d_1/convolution/ReadVariableOp:0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="48, 3, 3, 3" offset="36" size="2592" />
			<output>
				<port id="0" precision="FP16" names="CCT_OCR_1/conv_stem_1/conv2d_1/convolution/ReadVariableOp:0">
					<dim>48</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="CCT_OCR_1/conv_stem_1/conv2d_1/convolution/ReadVariableOp:0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>48</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="CCT_OCR_1/conv_stem_1/conv2d_1/BiasAdd/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>64</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>64</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Reshape_99835_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 48, 1, 1" offset="2628" size="96" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Reshape_99835" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="CCT_OCR_1/conv_stem_1/conv2d_1/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>64</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="CCT_OCR_1/conv_stem_1/conv2d_1/BiasAdd:0">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>64</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="CCT_OCR_1/conv_stem_1/conv2d_1/mul_1" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>64</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="CCT_OCR_1/conv_stem_1/conv2d_1/mul_1:0">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>64</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="CCT_OCR_1/conv_stem_1/max_blur_pooling2d_1/MaxPool2d" type="MaxPool" version="opset8">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="1, 1" kernel="2, 2" rounding_type="floor" auto_pad="explicit" index_element_type="i64" axis="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>64</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="CCT_OCR_1/conv_stem_1/max_blur_pooling2d_1/MaxPool2d:0">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>64</dim>
					<dim>128</dim>
				</port>
				<port id="2" precision="I64">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>64</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Reshape_99849_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="48, 1, 1, 3, 3" offset="2724" size="864" />
			<output>
				<port id="0" precision="FP16">
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Reshape_99849" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="CCT_OCR_1/conv_stem_1/max_blur_pooling2d_1/depthwise" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="0, 0" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>64</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="CCT_OCR_1/conv_stem_1/max_blur_pooling2d_1/depthwise:0">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="CCT_OCR_1/conv_stem_1/conv2d_1_2/convolution/ReadVariableOp:0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="80, 48, 3, 3" offset="3588" size="69120" />
			<output>
				<port id="0" precision="FP16" names="CCT_OCR_1/conv_stem_1/conv2d_1_2/convolution/ReadVariableOp:0">
					<dim>80</dim>
					<dim>48</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="CCT_OCR_1/conv_stem_1/conv2d_1_2/convolution/ReadVariableOp:0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>80</dim>
					<dim>48</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>80</dim>
					<dim>48</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="CCT_OCR_1/conv_stem_1/conv2d_1_2/BiasAdd/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>80</dim>
					<dim>48</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>80</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Reshape_99902_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 80, 1, 1" offset="72708" size="160" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>80</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Reshape_99902" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>80</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>80</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="CCT_OCR_1/conv_stem_1/conv2d_1_2/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>80</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>80</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="CCT_OCR_1/conv_stem_1/conv2d_1_2/BiasAdd:0">
					<dim>-1</dim>
					<dim>80</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="CCT_OCR_1/conv_stem_1/conv2d_1_2/mul_1" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>80</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="CCT_OCR_1/conv_stem_1/conv2d_1_2/mul_1:0">
					<dim>-1</dim>
					<dim>80</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="CCT_OCR_1/conv_stem_1/conv2d_2_1/convolution/ReadVariableOp:0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="96, 80, 3, 3" offset="72868" size="138240" />
			<output>
				<port id="0" precision="FP16" names="CCT_OCR_1/conv_stem_1/conv2d_2_1/convolution/ReadVariableOp:0">
					<dim>96</dim>
					<dim>80</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="CCT_OCR_1/conv_stem_1/conv2d_2_1/convolution/ReadVariableOp:0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>96</dim>
					<dim>80</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>80</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="CCT_OCR_1/conv_stem_1/conv2d_2_1/BiasAdd/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>80</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>80</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Reshape_99919_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 96, 1, 1" offset="211108" size="192" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Reshape_99919" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="CCT_OCR_1/conv_stem_1/conv2d_2_1/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="CCT_OCR_1/conv_stem_1/conv2d_2_1/BiasAdd:0">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="CCT_OCR_1/conv_stem_1/conv2d_2_1/mul_1" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="CCT_OCR_1/conv_stem_1/conv2d_2_1/mul_1:0">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="CCT_OCR_1/conv_stem_1/conv2d_3_1/convolution/ReadVariableOp:0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="112, 96, 3, 3" offset="211300" size="193536" />
			<output>
				<port id="0" precision="FP16" names="CCT_OCR_1/conv_stem_1/conv2d_3_1/convolution/ReadVariableOp:0">
					<dim>112</dim>
					<dim>96</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="CCT_OCR_1/conv_stem_1/conv2d_3_1/convolution/ReadVariableOp:0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>112</dim>
					<dim>96</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>112</dim>
					<dim>96</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="CCT_OCR_1/conv_stem_1/conv2d_3_1/BiasAdd/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>112</dim>
					<dim>96</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>112</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Reshape_99936" type="Const" version="opset1">
			<data element_type="f32" shape="1, 112, 1, 1" offset="404836" size="448" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="CCT_OCR_1/conv_stem_1/conv2d_3_1/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>112</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>112</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="CCT_OCR_1/conv_stem_1/conv2d_3_1/BiasAdd:0">
					<dim>-1</dim>
					<dim>112</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="CCT_OCR_1/conv_stem_1/conv2d_3_1/mul_1" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>112</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="CCT_OCR_1/conv_stem_1/conv2d_3_1/mul_1:0">
					<dim>-1</dim>
					<dim>112</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="CCT_OCR_1/patch_extractor_1/convolution__395:0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="448, 112, 2, 2" offset="405284" size="401408" />
			<output>
				<port id="0" precision="FP16" names="CCT_OCR_1/patch_extractor_1/convolution__395:0">
					<dim>448</dim>
					<dim>112</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="CCT_OCR_1/patch_extractor_1/convolution__395:0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>448</dim>
					<dim>112</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>448</dim>
					<dim>112</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="CCT_OCR_1/patch_extractor_1/convolution" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>112</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>448</dim>
					<dim>112</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="CCT_OCR_1/patch_extractor_1/convolution:0">
					<dim>-1</dim>
					<dim>448</dim>
					<dim>16</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Constant_99947" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="806692" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="CCT_OCR_1/patch_extractor_1/convolution__396" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>448</dim>
					<dim>16</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="CCT_OCR_1/patch_extractor_1/convolution__396:0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>32</dim>
					<dim>448</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Constant_106536" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="806724" size="24" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="CCT_OCR_1/patch_extractor_1/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>32</dim>
					<dim>448</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="CCT_OCR_1/patch_extractor_1/Reshape_1:0">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>448</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Transpose_104290_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="112, 448" offset="806748" size="100352" />
			<output>
				<port id="0" precision="FP16">
					<dim>112</dim>
					<dim>448</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Transpose_104290" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>112</dim>
					<dim>448</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>112</dim>
					<dim>448</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="CCT_OCR_1/mlp_1/dense_1/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>448</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>112</dim>
					<dim>448</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="CCT_OCR_1/mlp_1/dense_1/MatMul:0">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Constant_106204_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 112" offset="907100" size="224" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Constant_106204" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="CCT_OCR_1/mlp_1/dense_1/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="CCT_OCR_1/mlp_1/dense_1/BiasAdd:0">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="CCT_OCR_1/mlp_1/dense_1/mul_1" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="CCT_OCR_1/mlp_1/dense_1/mul_1:0">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Constant_106205_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 512, 112" offset="907324" size="114688" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Constant_106205" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Add_104133" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="ShapeOf_104134" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="CCT_OCR_1/pos_emb_1/BroadcastTo__425:0,CCT_OCR_1/pos_emb_1/Shape:0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Maximum_104135" type="Maximum" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="CCT_OCR_1/Add" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="CCT_OCR_1/Add:0">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Constant_106206" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="1022012" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="CCT_OCR_1/transformer_block_1_1/dy_t_1/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="CCT_OCR_1/transformer_block_1_1/dy_t_1/Mul:0">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="CCT_OCR_1/transformer_block_1_1/dy_t_1/Tanh" type="Tanh" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="CCT_OCR_1/transformer_block_1_1/dy_t_1/Tanh:0">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Constant_106207_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 112" offset="1022016" size="224" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Constant_106207" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="CCT_OCR_1/transformer_block_1_1/dy_t_1/mul_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="CCT_OCR_1/transformer_block_1_1/dy_t_1/mul_1:0">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Constant_106208_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 112" offset="1022240" size="224" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Constant_106208" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="CCT_OCR_1/transformer_block_1_1/dy_t_1/add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="CCT_OCR_1/transformer_block_1_1/dy_t_1/add:0">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Transpose_104306_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="112, 112" offset="1022464" size="25088" />
			<output>
				<port id="0" precision="FP16">
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Transpose_104306" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="CCT_OCR_1/transformer_block_1_1/multi_head_attention_1/key_1/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="CCT_OCR_1/transformer_block_1_1/multi_head_attention_1/key_1/MatMul:0">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="const_fold_opt__536" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="1047552" size="32" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="const_fold_opt__536">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="CCT_OCR_1/transformer_block_1_1/multi_head_attention_1/key_1/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="CCT_OCR_1/transformer_block_1_1/multi_head_attention_1/key_1/Reshape_1:0">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>2</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Constant_106209_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 2, 56" offset="1047584" size="224" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Constant_106209" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="CCT_OCR_1/transformer_block_1_1/multi_head_attention_1/key_1/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>2</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="CCT_OCR_1/transformer_block_1_1/multi_head_attention_1/key_1/Add:0">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>2</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Constant_100030" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="1047808" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="CCT_OCR_1/transformer_block_1_1/multi_head_attention_1/transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>2</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="CCT_OCR_1/transformer_block_1_1/multi_head_attention_1/transpose:0">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>512</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Transpose_104311_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="112, 112" offset="1047840" size="25088" />
			<output>
				<port id="0" precision="FP16">
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Transpose_104311" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="CCT_OCR_1/transformer_block_1_1/multi_head_attention_1/query_1/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="CCT_OCR_1/transformer_block_1_1/multi_head_attention_1/query_1/MatMul:0">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="CCT_OCR_1/transformer_block_1_1/multi_head_attention_1/query_1/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="CCT_OCR_1/transformer_block_1_1/multi_head_attention_1/query_1/Reshape_1:0">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>2</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Constant_106210" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="1072928" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Multiply_105975" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>2</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>2</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Constant_106211_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 2, 56" offset="1072932" size="224" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Constant_106211" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="CCT_OCR_1/transformer_block_1_1/multi_head_attention_1/Mul" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>2</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="CCT_OCR_1/transformer_block_1_1/multi_head_attention_1/Mul:0">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>2</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Constant_100032" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="806692" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="CCT_OCR_1/transformer_block_1_1/multi_head_attention_1/transpose_1" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>2</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="CCT_OCR_1/transformer_block_1_1/multi_head_attention_1/transpose_1:0">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>56</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="CCT_OCR_1/transformer_block_1_1/multi_head_attention_1/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>512</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>56</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="CCT_OCR_1/transformer_block_1_1/multi_head_attention_1/MatMul:0">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="CCT_OCR_1/transformer_block_1_1/multi_head_attention_1/softmax_1_1/Softmax" type="SoftMax" version="opset8">
			<data axis="2" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="CCT_OCR_1/transformer_block_1_1/multi_head_attention_1/softmax_1_1/Softmax:0">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Transpose_104318_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="112, 112" offset="1073156" size="25088" />
			<output>
				<port id="0" precision="FP16">
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Transpose_104318" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="CCT_OCR_1/transformer_block_1_1/multi_head_attention_1/value_1/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="CCT_OCR_1/transformer_block_1_1/multi_head_attention_1/value_1/MatMul:0">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="CCT_OCR_1/transformer_block_1_1/multi_head_attention_1/value_1/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="CCT_OCR_1/transformer_block_1_1/multi_head_attention_1/value_1/Reshape_1:0">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>2</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Constant_106212_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 2, 56" offset="1098244" size="224" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Constant_106212" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="CCT_OCR_1/transformer_block_1_1/multi_head_attention_1/value_1/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>2</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="CCT_OCR_1/transformer_block_1_1/multi_head_attention_1/value_1/Add:0">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>2</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Constant_100026" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="1047808" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="CCT_OCR_1/transformer_block_1_1/multi_head_attention_1/transpose_3" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>2</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="CCT_OCR_1/transformer_block_1_1/multi_head_attention_1/transpose_3:0">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>512</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="CCT_OCR_1/transformer_block_1_1/multi_head_attention_1/MatMul_1" type="MatMul" version="opset1">
			<data transpose_a="true" transpose_b="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>512</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="CCT_OCR_1/transformer_block_1_1/multi_head_attention_1/MatMul_1:0">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>512</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Constant_100039" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="1047808" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="CCT_OCR_1/transformer_block_1_1/multi_head_attention_1/transpose_4" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>512</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="CCT_OCR_1/transformer_block_1_1/multi_head_attention_1/transpose_4:0">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>2</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="const_fold_opt__563" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="1098468" size="24" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="const_fold_opt__563">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="CCT_OCR_1/transformer_block_1_1/multi_head_attention_1/attention_output_1/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>2</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="CCT_OCR_1/transformer_block_1_1/multi_head_attention_1/attention_output_1/Reshape:0">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Transpose_104323_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="112, 112" offset="1098492" size="25088" />
			<output>
				<port id="0" precision="FP16">
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="Transpose_104323" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
